Транслятор_запросав_SQL/src/Catalogs/Методанные1С/Методанные1С.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Методанные1С</name>
  <comment>Объекты конфигурации</comment>
  <hierarchical>true</hierarchical>
  <owners>Catalog.БазыДанных</owners>
  <attributes>
    <name>Синоним</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяТаблицыХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Метаданные</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Транслятор_запросав_SQL/src/CommonModules/СтруктураДанныхСервер/Module.bsl
#Область Структура


Процедура ЗаполнитьДеревоМД(БазаДанных) Экспорт
	
	
	ДобавитьКлассМД(БазаДанных, "Планы обмена", Метаданные.ПланыОбмена, БиблиотекаКартинок.ПланОбмена);
	ДобавитьКлассМД(БазаДанных, "Константы", Метаданные.Константы, БиблиотекаКартинок.Константа);
	ДобавитьКлассМД(БазаДанных, "Справочники", Метаданные.Справочники, БиблиотекаКартинок.Справочник);
	ДобавитьКлассМД(БазаДанных, "Документы", Метаданные.Документы, БиблиотекаКартинок.Документ);
	ДобавитьКлассМД(БазаДанных, "Журналы документов", Метаданные.ЖурналыДокументов, БиблиотекаКартинок.ЖурналДокументов);
	ДобавитьКлассМД(БазаДанных, "Перечисления", Метаданные.Перечисления, БиблиотекаКартинок.Перечисление);
	ДобавитьКлассМД(БазаДанных, "Планы видов характеристик", Метаданные.ПланыВидовХарактеристик, БиблиотекаКартинок.ПланВидовХарактеристик);
	ДобавитьКлассМД(БазаДанных, "Планы счетов", Метаданные.ПланыСчетов, БиблиотекаКартинок.ПланСчетов);
	ДобавитьКлассМД(БазаДанных, "Планы видов расчета", Метаданные.ПланыВидовРасчета, БиблиотекаКартинок.ПланВидовРасчета);
	ДобавитьКлассМД(БазаДанных, "Регистры сведений", Метаданные.РегистрыСведений, БиблиотекаКартинок.РегистрСведений);
	ДобавитьКлассМД(БазаДанных, "Регистры накопления", Метаданные.РегистрыНакопления, БиблиотекаКартинок.РегистрНакопления);
	ДобавитьКлассМД(БазаДанных, "Регистры бухгалтерии", Метаданные.РегистрыБухгалтерии, БиблиотекаКартинок.РегистрБухгалтерии);
	ДобавитьКлассМД(БазаДанных, "Регистры расчета", Метаданные.РегистрыРасчета, БиблиотекаКартинок.РегистрРасчета);
	ДобавитьКлассМД(БазаДанных, "Бизнес-процессы", Метаданные.БизнесПроцессы, БиблиотекаКартинок.БизнесПроцесс);
	ДобавитьКлассМД(БазаДанных, "Задачи", Метаданные.Задачи, БиблиотекаКартинок.Задача);
	ДобавитьКлассМД(БазаДанных, "Внешние источники данных", Метаданные.ВнешниеИсточникиДанных, БиблиотекаКартинок.ВнешнийИсточникДанных);
	

КонецПроцедуры

Процедура ДобавитьКлассМД(БазаДанных, ИмяРаздела, КлассМД, ИконкаПодчиненного)

		НовыйРаздел= Справочники.Методанные1С.СоздатьГруппу();
		НовыйРаздел.Наименование= ИмяРаздела;
		НовыйРаздел.Владелец= БазаДанных;
		НовыйРаздел.Записать();

	Для Каждого ОбъектМД Из КлассМД Цикл

			НовыйЭлемент= Справочники.Методанные1С.СоздатьЭлемент();
			НовыйЭлемент.Владелец= БазаДанных;
			НовыйЭлемент.Родитель= НовыйРаздел.Ссылка;
			НовыйЭлемент.Наименование= ОбъектМД.Имя;
			НовыйЭлемент.Метаданные= ОбъектМД.ПолноеИмя();
			НовыйЭлемент.Синоним= ?(ОбъектМД.Синоним = "", ОбъектМД.Имя, ОбъектМД.Синоним);
			НовыйЭлемент.Записать();

			
		Для Каждого Реквизит Из ОбъектМД.СтандартныеРеквизиты Цикл
			НовоеПоле= Справочники.Поля.СоздатьЭлемент();
			НовоеПоле.Владелец= НовыйЭлемент.Ссылка;
			НовоеПоле.Наименование= Реквизит.Имя;
			НовоеПоле.Синоним= ?(Реквизит.Синоним = "", Реквизит.Имя, Реквизит.Синоним);
			НовоеПоле.Записать();
		КонецЦикла;
		
		Для Каждого Реквизит Из ОбъектМД.Реквизиты Цикл
			НовоеПоле= Справочники.Поля.СоздатьЭлемент();
			НовоеПоле.Владелец= НовыйЭлемент.Ссылка;
			НовоеПоле.Наименование= Реквизит.Имя;
			НовоеПоле.Синоним= ?(Реквизит.Синоним = "", Реквизит.Имя, Реквизит.Синоним);
			НовоеПоле.Записать();
		КонецЦикла;

	КонецЦикла;

КонецПроцедуры

Процедура УдалитьСтруктуруНаСервере(Всю=Ложь) Экспорт
	Если Всю Тогда
		Выборка= Справочники.БазыДанных.Выбрать();
		Пока Выборка.Следующий() Цикл
			Элем= Выборка.Ссылка.ПолучитьОбъект();
			Элем.Удалить();
		КонецЦикла;
	КонецЕсли;
	
	Выборка= Справочники.Методанные1С.Выбрать();
	Пока Выборка.Следующий() Цикл
		Элем= Выборка.Ссылка.ПолучитьОбъект();
		Элем.Удалить();
	КонецЦикла;
	
	Выборка= Справочники.Поля.Выбрать();
	Пока Выборка.Следующий() Цикл
		Элем= Выборка.Ссылка.ПолучитьОбъект();
		Элем.Удалить();
	КонецЦикла;

	Выборка= Справочники.Индексы.Выбрать();
	Пока Выборка.Следующий() Цикл
		Элем= Выборка.Ссылка.ПолучитьОбъект();
		Элем.Удалить();
	КонецЦикла;
	
КонецПроцедуры
#КонецОбласти
